{
    "NavBar": {
"home":"Accueil",
"about": "A propos",
"contact": "Contactez-moi",
"projects": "Mes projets"
    },
    "Homepage": {
        "maintitle": "Bienvenue sur mon portfolio"
    },
    "MyProjects":{
        "projectNature": "Nature du projet",
        "lang": "Langages utilisés",
        "link": "Lien vers le site",
        "github": "Lien vers GitHub"
    },
    "MyProjectsDetails": {
        "details": "Details du projet",
        "description": {
            "1": "Quiz a été mon premier projet à la Wild Code School. L'objectif était d'expérimenter JavaScript et la manipulation du DOM. Il a été réalisé en deux semaines avec mes collègues, Matthieu et Victor. Votre objectif est clair : vaincre la Faucheuse. Vous avez trois vies pour répondre à 12 questions. Pouvez-vous la battre ?",
            "2" : "Tech'tastik est un projet SoloRush réalisé en 24 heures. Cet exercice avait pour objectif de nous familiariser avec React, en particulier la création de composants, la gestion des props et l'application de filtres. Pour cela, j'ai choisi de concevoir une application proposant à la vente des objets technologiques insolites. Besoin d'idées pour un futur cadeau ? Rendez-vous sur le site !",
            "3":"MeteoApo est un projet réalisé en 36 heures, dans le cadre d’un Protojam. Deux contraintes étaient imposées au départ : créer une application sur le thème de l’apocalypse et utiliser une API. Nous avons donc choisi de détourner les données d’une application météo (Weather Stack) pour en extraire des informations sur vos chances de survie en fonction de la ville sélectionnée. Prêt à calculer vos chances ?",
            "4": "Heraclès Labour est un petit jeu inspiré des 12 travaux d'Hercule. L'objectif est de manipuler JavaScript pour pratiquer la programmation orientée objet. Aucune application ne sera déployée pour ce projet, mais le code est disponible sur GitHub. Prêt à affronter le lion de Némée ? Clonez le dépôt, puis lancez le jeu depuis le terminal de votre éditeur de code avec la commande suivante : node index.js",
            "5":"MusicWild est le deuxième projet que nous avons réalisé à la Wild Code School et le premier en Full-Stack. Ce travail d'équipe, mené avec Christine, Célio, Aurélien et moi-même, a été réalisé en suivant la méthodologie agile/scrum. Ce projet nous a permis d'explorer le développement côté serveur avec Express pour effectuer des appels à une API. MusicWild est un site de musique exploitant l'API Deezer, qui permet de naviguer entre plusieurs routes dynamiques pour afficher des extraits musicaux de votre choix (30 secondes par morceau). Alors, prêt(e) à vous détendre avec un peu de musique ?"
        } 
    }
}